import 'dart:math';

class Wisdom {
  static const String _raw =
      '''في الرياضيات، إذا كان لديك 23 شخصًا في غرفة، فإن احتمال وجود شخصين يحتفلان بعيد ميلاد في نفس اليوم يبلغ أكثر من 50٪.
@هل تعلم أن احتمال أن يلقى شخص برقة أثناء حياته حوالي 1 في 3000؟ ومع ذلك، فإن احتمال أن يلقى شخص ما برقة مرتين في حياته هو 1 في 9 مليون!
@إذا كان لديك 40 بطاقة في مجموعة، فإن احتمال أن تكون أول 5 بطاقات من نفس اللون هو حوالي 1 في 23.
@احتمال أن تفوز بجائزة اليانصيب الكبرى (مثل البورصة) هو حوالي 1 في 175 مليون!
@هل تعلم أن احتمال أن يكون لديك نفس الحمض النووي كأحد من يعيش في جزيرة بريطانية صغيرة هو حوالي 1 في 77؟
@احتمال أن يكون لديك نفس الحلم مثل شخص آخر هو حوالي 1 في 5.
@احتمال أن تكون مهاراتك الرياضية مثل تلك للاعب كرة القدم ليونيل ميسي هو حوالي 1 في 5.7 مليار!
@احتمال أن تكون لديك نفس الرقم القومي المعرف لشخص آخر هو حوالي 1 في 60 مليار!
@احتمال أن يكون لديك نفس الاسم الأول واسم العائلة مثل شخص آخر هو حوالي 1 في 50.
@احتمال أن يكون لديك نفس الأحلام الليلية كشخص آخر هو حوالي 1 في 3.
@احتمال أن تجد شخصًا يشبهك تمامًا في الشكل والشخصية هو حوالي 1 في 135.
@احتمال أن يكون لديك نفس التاريخ الميلادي مثل شخص آخر هو حوالي 1 في 365.
@احتمال أن تفوز بجائزة نوبل للسلام هو حوالي 1 في 300 مليون!
@احتمال أن تجد شخصًا يشبهك في التفكير والاهتمامات هو حوالي 1 في 100.
@احتمال أن تكون لديك نفس الميلاد (بدقة) كشخص آخر هو حوالي 1 في 48,627,125.
@احتمال أن تجد شخصًا يشبهك في الذائقة الموسيقية هو حوالي 1 في 30.
@تمال أن تفقد هاتفك المحمول هو حوالي 1 في 10.
@احتمال أن تجد شخصًا يشبهك في الطول والوزن هو حوالي 1 في 200.
@احتمال أن تجد شخصًا يشبهك في الشهية لأطعمة معينة هو حوالي 1 في 20.
@احتمال أن تجد شخصًا يشبهك في نظرته إلى الحياة وأهدافه هو حوالي 1 في 80.
@احتمال أن تجد شخصًا يشبهك في طريقة تعامله مع الضغط والإجهاد هو حوالي 1 في 40.
@احتمال أن تجد شخصًا يشبهك في قدرته على التعبير عن المشاعر والأفكار هو حوالي 1 في 55.
@احتمال أن تجد شخصًا يشبهك في قدرته على فهم المزاج والعاطفة لدى الآخرين هو حوالي 1 في 65.
@احتمال أن تجد شخصًا يشبهك في قدرته على التعامل مع الأزمات والمشاكل بشكل فعَّال هو حوالي 1 في 70.
@احتمال أن تجد شخصًا يشبهك في قدرته على إظهار التسامح والرحمة تجاه الآخرين هو حوالي 1 في 75.
@من جد وجد 🙄🙄''';

  static String getWise() {
    return _raw
        .split('@')[Random().nextInt(_raw.split('@').length)]
        .replaceAll('\n', '');
  }
}
